src/test/java/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                                     xmlns:gs="http://weather.com/senchenko">
<soapenv:Header/>
<soapenv:Body>
    <gs:getCityRequest>
        <gs:name>Vitebsk</gs:name>
    </gs:getCityRequest>
</soapenv:Body>
</soapenv:Envelope>